In [35]:
import numpy as np
import pandas as pd

In [36]:
df1 = pd.read_csv('ICRISAT-SESAMUM.csv')

In [37]:
df1.head()

   Year  Dist Name  SESAMUM PRODUCTION (1000 tons)
0  1966  Hyderabad                             0.4
1  1967  Hyderabad                             0.8
2  1968  Hyderabad                             0.3
3  1969  Hyderabad                             1.0
4  1970  Hyderabad                             0.9

In [38]:
df1 = df1[['Year','SESAMUM PRODUCTION (1000 tons)']]

In [39]:
df1.columns = ['year','sesamum_production']

In [40]:
df1

     year  sesamum_production
0    1966                0.40
1    1967                0.80
2    1968                0.30
3    1969                1.00
4    1970                0.90
..    ...                 ...
463  2013                1.87
464  2014                2.15
465  2015                1.01
466  2016                2.44
467  2017                1.61

[468 rows x 2 columns]

In [41]:
df1_sum = df1.groupby('year').sum()
df1_sum.head()
# sum per year of the above data

      sesamum_production
year
1966                11.7
1967                16.2
1968                19.3
1969                18.8
1970                17.6

In [42]:
df1_sum = df1_sum[['sesamum_production']]

In [43]:
df1_sum.head()

      sesamum_production
year
1966                11.7
1967                16.2
1968                19.3
1969                18.8
1970                17.6

In [44]:
df1_sum.to_csv('yearly_sesamum_prod.csv')

In [45]:
a = pd.read_csv('yearly_sesamum_prod.csv')
a.head()

   year  sesamum_production
0  1966                11.7
1  1967                16.2
2  1968                19.3
3  1969                18.8
4  1970                17.6